SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( CP1507  
	Type ( Engine )
	WagonShape ( cp1507.s )
	Include ( "Openrails/1general.inc" )
	Include ( "Openrails/2brakewv.inc" )
	Include ( "Openrails/3friction.inc" )
	Include ( "Openrails/4light.inc" )

	IntakePoint ( -3.33 0.4 FuelDiesel )
	IntakePoint ( 3.33 0.4 FuelDiesel )
)

Engine ( CP1507  
	Wagon ( Cp1507 )
	Name ( "CP 1507 Alco" )
	Sound ( 1500cab.sms )
	CabView ( Cp1501.cvf )

	Include ( "Openrails/effects.inc" )
	Include ( "Openrails/5engine.inc" )
	Include ( "Openrails/6brakesysv.inc" )
	Include ( "Openrails/7other.inc" )
 	Include ( "Openrails/9controllersv.inc" )
	Include ( "Openrails/procedures1500.inc" )

	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 1 )
    		MonitoringDeviceAppliesCutsPower( 0 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    	)
	VigilanceMonitor(
		MonitoringDeviceMonitorTimeLimit( 45 )
		MonitoringDeviceAlarmTimeLimit( 37 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 1 )
	)
	OverspeedMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 0 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 130 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceTriggerOnTrackOverspeed( 1 )
		MonitoringDeviceTriggerOnTrackOverspeedMargin( 2 )
		MonitoringDeviceResetOnZeroSpeed( 1 )
		MonitoringDeviceResetOnResetButton( 0 )
	)
    	Description (	
	"CP 1500 Series diesel-electric locomotive\n\n"+
	"Entered service in 1948\n\n"+
	"Wheel Arrangement: A1A A1A\n\n"+
	"Brake Type: Vacuum\n\n"+
	"Livery: Green and Silver"
    	)
)
